{
  "year": "2019",
  "date": "Saturday, 19th October 2019",
  "videos": "https://engineers.sg/conference/geekcampsg-2019",
  "venue": "Shaw Foundation Alumni House, NUS, Auditorium Level 2, 11 Kent Ridge Drive, Singapore 119244",
  "talks": [
    {
      "title": "How to create a web application in multiple programming languages",
      "speaker": "Chang Sau Sheong",
      "avatar": "https://avatars.io/twitter/sausheong",
      "speakerLink": "http://twitter.com/sausheong",
      "summary": "Tanuki is a polyglot web framework that allows you to develop web applications and services in multiple programming languages.",
      "videos": "https://youtu.be/EYxPLc5cx8Y"
    },
    {
      "title": "Building Web-Based Audio Player for Obscure Audio Format",
      "speaker": "Kenrick",
      "summary": "BRSTM is an audio file format that are used on Nintendo Wii games and many others. This talk will cover the journey in building this player which decodes the BRSTM file entirely on browser and plays it back using Web Audio API.",
      "video": "https://youtu.be/JQFdrAwwFSY"
    },
    {
      "title": "Implementing Open Source-Based Motion Controlled Robotic Arms with Python and C",
      "speaker": "Renaldi Gondosubroto",
      "summary": "This talk will demonstrate how to easily program two DIY open source motion-controlled robotic arms, demonstrating how to start your own mechatronics-related projects easily.",
      "video": "https://youtu.be/KjpJUAYZfzU"
    },
    {
      "title": "Don’t let your Internet Of Things become an Internet Of Targets",
      "speaker": "Hazwan Hassan",
      "summary": " As current and future homes become pre-wired for connectivity and home renovators start providing “smart home” services, it is time to take a look at how they can be setup to ensure safety. We will explore how network segregation techniques can be used at home to keep the network safe.",
      "video": "https://youtu.be/RVgezwzclJI"
    },
    {
      "title": "Creating Art from Music",
      "speaker": "Subhransu Behera",
      "summary": "3 years ago I wanted to work on a project where I wanted to convert any image (art piece, selfie, random portrait) into music. The idea is based on mapping colors to musical notes. I spoke to a pianist and he asked - can you create an art from music instead. A unique art when someone plays music.",
      "video": "https://youtu.be/m-FKYHCOFdo"
    },
    {
      "title": "Love At First Byte: a romantic journey into the future of us",
      "speaker": "Sudharshan",
      "summary": "Love At First Byte, is a talk about humans, and how technology is going to shape us in the future. Discussing concepts like assistive technologies, brain machine interfaces, flying drones telepathically, and virtual realities. Simply put, this talk is a love story between mind and machine.",
      "video": "https://youtu.be/5mEMh69JR7I"
    },
    {
      "title": "Implementing Trigonometry in SCSS, and lessons learnt",
      "speaker": "Liu Weiyuan",
      "summary": "Basic CSS is insufficient. We use Sass (SCSS) to push the  stylesheet language to the limit, where it’s similar to a programming language. Through implementing Trigonometry in SCSS as an example, we harness engineering principles such as code reuse, and perform unit-testing of SCSS functions.",
      "video": "https://youtu.be/DE_q52uAj1w"
    },
    {
      "title": "WebThings: A secure gateway to connect your things to Internet",
      "speaker": "Dipesh Monga",
      "summary": "With the advent of the IoT, are we really making our lives simpler or drowning ourselves in a vast ocean by uploading our lives to the internet? WebThings is an open platform for monitoring and controlling devices over the web that comes to the rescue.",
      "video": "https://youtu.be/CysBXTJe3QU"
    },
    {
      "title": "The Singapore Tech Community - A 10 year retrospective",
      "speaker": "Michael Cheng",
      "summary": "A talk on the development of the local technology meetup scene through the eyes of a community builder & organizer. I’ll show the progression from our humble beginnings and how foreign talent and different overseas student exchange programs have shaped the local tech and startup scene.",
      "video": "https://youtu.be/DmheY4_0FA0"
    }
  ],
  "workshop": [
    {
      "title": "Workshop 1: Getting Started with Smart Contracts",
      "speaker": "Yos Riady",
      "summary": "Come and discover how you can write smart contracts and build decentralized applications! In this workshop, get a practical hands-on with the Solidity programming language.",
      "video": "https://youtu.be/QiJ_zN82ry4"
    },
    {
      "title": "Workshop 2: Virtual Network Testbed Using GNS3",
      "speaker": "Hazwan Hassan",
      "summary": "Ever wanted to build complex virtual networks to test and practice networking concepts or build a test production environment for practicing software development but find building such networks difficult? In this workshop, learn about GNS3 and how to build and manage virtual networks visually.",
      "video": "https://youtu.be/ysLpOsY-WQI"
    }
  ],
  "community-village": [
    {
      "title": "Challenge by OSI Layer 8",
      "summary": "Opening connection to ctf.makerforce.io"
    },
    {
      "title": "GeekcampSG x Women Who Code Singapore",
      "summary": "Machines Learning and Edge Computing Workshop. This workshop will help you get familiarised with the powerful use of deep learning models on the small devices. We will tackle the problem of recognising hand gestures by using the RealSense depth sensing camera and then run our model on the edge using Intel’s Neural Compute Stick."
    }
  ],
  "speakers-bio": [
    {
      "speaker": "Chang Sau Sheong",
      "position": "CEO, SP Digital",
      "img": "speakers/past/sausheong.jpg"
    },
    {
      "speaker": "Micheal Cheng",
      "position": "Lead Engineer, GovTech",
      "img": "speakers/past/michael_cheng.jpeg"
    },
    {
      "speaker": "Kenrick",
      "position": "Front-End Engineer, Shopee",
      "img": "speakers/past/kenrick.jpeg"
    },
    {
      "speaker": "Renaldi Gondosubroto",
      "position": "Founder and CEO, GReS Studio",
      "img": "speakers/past/Renaldi-Gondosubroto.png"
    },
    {
      "speaker": "Hazwan Hassan",
      "position": "Cyber Security Enthusiast",
      "img": "speakers/past/muhammad_hazwan.jpg"
    },
    {
      "speaker": "Subhransu Behera",
      "position": "Principal Software Engineer, SP Digital",
      "img": "speakers/past/subhransu_behera.jpg"
    },
    {
      "speaker": "Yos Riady",
      "position": "Software Engineer, TenX",
      "img": "speakers/past/yosss.jpg"
    },
    {
      "speaker": "Sudharshan",
      "position": "Hacker, Maker, Coder, Tech-Enthusiast",
      "img": "speakers/past/Sudharshan.jpeg"
    },
    {
      "speaker": "Liu Weiyuan",
      "position": "Full Stack Engineer, Rakuten Viki",
      "img": "speakers/past/weiyuan.jpg"
    },
    {
      "speaker": "Dipesh Mong",
      "position": "Tech Speaker, Mozilla",
      "img": "speakers/past/dipesh.jpg"
    }
  ]
}
