[
 {
   "Title": "Algorithms for Startup Founders ",
   "Abstract": "Algorithms are for everyone, not just for programmers! In this talk I will be discussing how algorithms can be used to help startup founders to solve some of their most common problems.",
   "Description": "Algorithms are for everyone, not just for programmers! In this talk I will be discussing how algorithms can be used to help startup founders to figure out some of their most common problems. I will explain how you can use algorithms to hire the best engineers, to decide whether to pivot or persevere, to know what you should do first, to hustle for the best opportunities and to build the best product for the market. Am I for real? Check out my talk and find out! (Individual results may vary).",
   "Speaker": "Sau Sheong Chang",
   "Bio": "Sau Sheong has been doing software development for 22 years, mostly in web application development. He is active in the Ruby and Go developer communities have have contributed to open source projects and spoke at meetups and conferences. Sau Sheong has also published 4 programming-related books, on Ruby and Go. He currently works for SPGroup (previously known as Singapore Power), based out of sunny Singapore and has in his career worked for PayPal, HP, Yahoo, and also ran a technology startup during the dot-com days.",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "Are We Web Yet? : Building Web Stuff Using Rust ",
   "Abstract": "Come and be fascinated by Rust’s mature HTTP stack and various frameworks that enable you to build APIs and backend services quickly.",
   "Description": "Want to know why Rust is so fast & safe? Does Rust have a strong web-stack? How to create an end to end RESTful APIs in Rust?\\n\\nIn this talk, we will venture deep into the belly of Rust’s web-stack to uncover various web frameworks that enable you to build APIs and backend services quickly. We’ll deep-dive into the different steps associated with creating a RESTful API service connected to MongoDB database to get a feel of a full end-to-end API solution in Rust. Discover this and more tips for building web projects where memory safety and speed are non-trivial.\\n\\nSession Content:\\n\\n- Elevator pitch about Rust language\\n- Overview of current Rust’s web-stack\\n- Demo on an end-to-end API solution in Rust\\n- Deep dive into code of the Demo\\n- Success story of npm’s Rust adoption\\n- About Rust community & support channels\\n- This talk will assume no background knowledge of Rust and will explain all various syntax and semantics.\\n\\nKey Takeaways:\\n\\n- The audience will appreciate Rust as an ideal choice for web projects where memory safety and speed are non-trivial\\n- Learn to build RESTful APIs using openly available Rust web frameworks like Nickel, Iron.\\n- Get to know about Rust features and community support channels\\n",
   "Speaker": "Vigneshwer Dhinakaran",
   "Bio": "Vigneshwer is an innovative data scientist from Bengaluru who crunches real-time data and builds AI algorithms for complex business problems. He believes that technology needs to have a human-centric design to cater solutions to a diverse audience. He’s an official Mozilla TechSpeaker and is the author of Rust Cookbook.",
   "Notes": "Speaking Credentials:\\n\\n- Delivered a session on demystifying AI in Mozfest 16 Open Science space\\n- Active Rust community, Rust India community mentor and leading of RainOfRust campaign\\n- Spoke about building AI models in rust at FOSSMEET17 @NITC & HKOSCon 2017\\n- Speaker at Codemotion Berlin, & Devfest Siberia\\n\\nSpeaker Skills:\\n\\n- Trained on developer evangelism skills in Mozilla TechSpeaker program\\n- Author of Rust Cookbook\\n- Awarded Rep of the Month for being heavily involved in helping build the Rust community in India\\n- Identified as a Rust Mobilizer superstar and conducted Mozilla’s mobilizer experiment pilot for Rust in India\\n- Founder and project lead for DeepRust, a deep learning library in Rust\\n- 3+ experience in implementing state of art ML algos for production IOT pipelines",
   "Format": "Full"
 },
 {
   "Title": "Artificial Intelligence Renaissance – How, Why, What's Next ",
   "Abstract": "We are at the beginning of the golden age in AI. However, among the hype lies much confusion about what AI is all about. In this talk, I aim to answer three common questions: How does AI work? Why now? What’s next? My passion is to bring AI closer to people and empower our limitless imagination.",
   "Description": "Google Deepmind made history with AlphaGo beating the best Go player in the world. Google Deepmind ignited the imagination of many scientists, researchers, and hobbyists by releasing papers outlining their solution. In this talk, I want to show you how we can make use of the same techniques employed by AlphaGo to solve games on OpenAI Gym. The beauty of games is that we can visually inspect the output as the AI agent plays it - we will step through the logic of deep reinforcement learning, the “train of thoughts” of the AI agent and how we can code all these up in Tensorflow and Python with just our laptop or a small cloud cluster.\\n\\nWhy now? Well, Chinese fortune believes in the alignment of the sun, moon and stars. In a sense, that’s what happened. AI used to be a privilege of the rich, crazy or both. Thankfully, we now have the alignment of software technology, data science techniques and affordable hardware for hobbyists like us to craft our own AI agents. An understanding of AI is necessary because what’s next is either the beginning of the greatest era of humanity or something out of our greatest nightmare. As geeks, we have the opportunity and responsibility to shape the development of AI, to make it accessible and beneficial to all our future generations. And of course, it all starts with this talk.\\nWhy now? Well, Chinese fortune believes in the alignment of the sun, moon and stars. In a sense, that’s what happened. AI used to be a privilege of the rich, crazy or both. Thankfully, we now have the alignment of software technology, data science techniques and affordable hardware for hobbyists like us to craft our own AI agents. An understanding of AI is necessary because what’s next is either the beginning of the greatest era of humanity or something out of our greatest nightmare. As geeks, we have the opportunity and responsibility to shape the development of AI, to make it accessible and beneficial to all our future generations. And of course, it all starts with this talk.",
   "Speaker": "Kai Xin THIA",
   "Bio": "I am a geek who likes to build stuff because I can. I also like to talk about things I created so hopefully others can jump on board and challenge me. I am passionate about the AI field and is currently specializing in it as part of my Masters at Georgia Tech, one of the top computer science schools in the US and one of the best research institutes in the field of AI. In my professional life, I am an experienced data scientist from Lazda data science team, fluent in Python, Scala, Java, R and works daily with Hadoop distributed systems. I am also the co-founder of DataScience SG, the largest data science community in Singapore.",
   "Notes": "I am a geek who likes to build stuff because I can. I also like to talk about things I created so hopefully others can jump on board and challenge me. I am passionate about the AI field and is currently specializing in it as part of my Masters at Georgia Tech, one of the top computer science schools in the US and one of the best research institutes in the field of AI. In my professional life, I am an experienced data scientist from Lazda data science team, have spoken at numerous conferences (Strata x Hadoop World ‘15, Tech in Asia Singapore’17, data science meetups), fluent in Python, Scala, Java, R and works daily with Hadoop distributed systems. I am also the co-founder of DataScience SG, the largest data science community in Singapore.\\n\\nMy github is quite empty as most of my projects are in private repos - either for school work or real work.",
   "Format": "Full"
 },
 {
   "Title": "Breaking the Binary World with Vue.js",
   "Abstract": "Vue.js is more consolidated than ever. It is the future of the MV* client side world and is one of the most promising alternatives, fighting with industry giants like React and Angular 2. I will show you the simplicity and power of this framework which combines the best parts of front end world.",
   "Description": "This talk exposes a binary situation in front-end world. Right now most people try to chose between React and Angular. Everybody knows that there are more choices but people prefer to pick between these two.\\n\\nThankfully the situation started to change and alternatives like Vue.js have an stronger role in front end apps. I want to briefly introduce what is Vue.js and how it works.The idea is to review the core concepts of the framework but also see how you can scale progressively when you have complex requirements\\n\\nI think would be great that Angular and React developers can see how to merge advantages and best parts of both frameworks to build a new one and break the polarization they have.\\n\\nI am not an evangelist. I will not try to convince developers to use Vue, just show the features, uses cases and advantages. And also let know the audience that OSS projects could became great without Facebook or Google behind it.",
   "Speaker": "Ignacio Anaya",
   "Bio": "I am a Full Stack Developer and Programming mentor mostly working with JavaScript techs as Node.js and Vue.js. With more than 8 years of experience, not just coding but also teaching, I am an enthusiastic OSS contributor who has cooperated with several JS (and Vue.js) libraries. I also like to participate in dev communities and conferences performing workshops, tech talks or just helping organizing.",
   "Notes": "According to Third Party Benchmark, Vue.js is one of the alternatives with better perfomance. Is also one of the mosts starred and forked project on GitHub. Its popularity and community has grown a lot last months. Besides that, there lot of people that could not learn it yet or would give it a chance. So I think is a great opportunity to make more popular.\\n\\nI am an experienced full stack developer and programming mentor. I started “my career” as speaker last year participating in local conf and meetups. But I also have a several years of experience teaching and mentoring developers. I worked with Vue for more than 1 year. I contributed the framework with tools and plugins and I also performed courses for online code schools like platzi.",
   "Format": "Full"
 },
 {
   "Title": "Building Machine Learning Units in Rust",
   "Abstract": "Learn to build an end-to-end, high-performance machine learning algorithm such as SVM, RF in Rust language which has the capabilities to solving classification problems.",
   "Description": "Rust is a great programming language for building stable and scalable mathematical AI models which can crunch real-time data and provide human level insights. The talk focuses on covering the methods by which one can implement the state-of-the-art machine learning units like SVM, RF in Rust lang to create an end to end learning system for solving a real-world machine learning problems.\\n\\nLive demos of a gender classification algorithm running on a web app will be showcased to the audience in which all the functional units are developed in Rust language.\\n\\nThe functional units include reading data from storage, designing the machine learning algorithm architecture for predicting the subject, as well as the other services of the web application for hosting the learning system.\\n\\nSession Content:\\n\\n- Introduction to AI\\n- Live demos\\n- Unique features of rust\\n- Why Rust is great for ML models\\n- Setting up the web app’s frontend & backend in Rust\\n- Data collection from edge device\\n- Building Machine Learning algorithm architecture\\n- Integration with web app\\n\\nKey Takeaways:\\n\\n- Learn the about unique rules and features of Rust\\n- Learn to build your first machine learning application in Rust\\n- Develop a template for creating mathematical implementation from scratch\\n- Gain experience with Code implementation of web application running algorithms in Rust",
   "Speaker": "Vigneshwer Dhinakaran",
   "Bio": "Vigneshwer is an innovative data scientist from Bengaluru who crunches real-time data and builds AI algorithms for complex business problems. He believes that technology needs to have a human-centric design to cater solutions to a diverse audience. He’s an official Mozilla TechSpeaker, and is the author of Rust Cookbook.",
   "Notes": "Speaking Credentials:\\n\\n- Delivered a session on demystifying AI in Mozfest 16 Open Science space\\n- Active Rust community, Rust India community mentor and leading of RainOfRust campaign\\n- Spoke about building AI models in rust at FOSSMEET17 @NITC & HKOSCon 2017\\n- Speaker at Codemotion Berlin, & Devfest Siberia\\n\\nSpeaker Skills:\\n\\n- Trained on developer evangelism skills in Mozilla TechSpeaker program\\n- Author of [Rust Cookbook](https://www.packtpub.com/application-development/rust-cookbook)\\n- Awarded [Rep of the Month](https://blog.mozilla.org/mozillareps/2017/07/28/rep-of-the-month-july-2017/) for being heavily involved in helping build the Rust community in India\\n- Identified as a [Rust Mobilizer superstar](https://blog.mozilla.org/mozillareps/2017/07/10/reps-mobilizer-experiment/) and conducted [Mozilla’s mobilizer experiment pilot](https://discourse.mozilla-community.org/t/results-of-the-mobilizer-experiment-for-rust-india/) for Rust in India\\n- Founder and project lead for DeepRust, a deep learning library in Rust\\n- 3+ experience in implementing state of art ML algos for production IOT pipelines\\n\\nRainOfRust Video Series:\\n\\n- [Introduction to Rust Lang](https://air.mozilla.org/rain-of-rust-2nd-online-meeting/)\\n- [Web development in Rust](https://air.mozilla.org/rain-of-rust-3rd-online-meeting/)\\n- [Rust API guidelines & std lib](https://air.mozilla.org/rain-of-rust-4th-online-meeting/)\\n\\n- Blog posts:\\n\\n- [Hacker’s guide to Rust programming](https://dvigneshwer.github.io/talks/2017-04-07-Rust-AIT)\\n- [Web development in Rust](https://dvigneshwer.github.io/posts/2017/05/Rust-web-dev/)\\n\\nSlides:\\n\\n- [Introduction to Rust](https://dvigneshwer.github.io/files/Deep_drive_into_Rust_programming_language.pdf)\\n- [Building AI units in Rust](https://dvigneshwer.github.io/files/AI_Rust.pdf)",
   "Format": "Full"
 },
 {
   "Title": "Building Messenger Chatbots with Python",
   "Abstract": "The app ecosystem keeps evolving. Desktop apps > web apps > mobile apps > bots. You don’t need to download 50 apps to access 50 services. All you need is your favorite messenger app and one chatbot. In this talk, i am going to discuss how to build your own messenger chatbot right way from python.",
   "Description": "It is predicted that Messaging apps will be new browser and chatbots will the new apps. Isn’t it cool that for every service to use, you do not need to download 100’s new apps? All you can access in your favorite messenger.\\n\\nAll the big giants like Facebook messenger, telegram, kik, wechat, viber, skype have opened their messenger platforms for bots. Customer support, bookings, HR, e-commerce, retail, travel etc are the fields where chatbots started ruling.\\n\\nSo, let’s explore building chatbots on one of the most popular messenger app from Facebook. In this talk, i am going to discuss how to I your own messenger chatbot right way from scratch with python.\\n\\nTalk Outline\\n\\n- What & Why Chatbots?\\n- Platforms\\n- Why Facebook Messenger?\\n- Bot setup\\n- Code\\n- Hello World\\n- Other Features Supported\\n- What's Next?",
   "Speaker": "Daxeel Soni",
   "Bio": "Computer Engineering undergrad student with the passion of startup product building using tech skills. I build stuff in the domain of Chatbots, web and IoT.\\n\\nI can be found at various tech and startup events in India. So, I meet new people, read online and build crazy products with my tech skills.\\n\\nProfile - https://daxeel.github.io",
   "Notes": "Respected Sir/Ma’am,\\n\\nI am 4th engineering student with the passion of coding cool stuff in python language. I am creating crazy things in Python since when I was in class 12.\\n\\nWhen Zuckerberg opened bots platform for developers, I tried and working with chatbots since 1.5 years. I created and tested tons of bots. Apart from coding, I love to teach Python and bots. I talk in local events and colleges on bots. I also invited to some local universities as an expert lecturer to teach students Python language. I am also one of the coaches of Django Girls(UK) Ahmedabad chapter.\\n\\nRecently i am selected for “Hack the North ‘17” MLH Hackathon which is going to be held on 15-17th September at the University of Waterloo, ON, Canada.\\n\\nOne of my successful bots : https://m.me/heynewsbot\\nEverything about me you can find here : https://daxeel.github.io",
   "Format": "Full"
 },
 {
   "Title": "Cakewalk WebVR development with A-Frame",
   "Abstract": "Ram is going to talk about easily building VR website using opensource library A-Frame. In this talk, you will learn to use various concepts & APIs of A-Frame to create interactive & immersive VR experiences on the web. Also learn how A-Frame is different from other similar frameworks like ReactVR.",
   "Description": "Have you noticed that the development of Virtual Reality experiences has started a major makeover of the computer industry? I believe that Virtual Reality is going to become a primary platform soon, which will completely change the way we work, play and communicate digitally. The Web, being the most open platform, is now a key participant for providing cool Virtual Reality experiences. I would love to talk about Building Virtual Reality websites using A-Frame in this version of GeekcampSG. A-Frame is an open-source web framework by Mozilla for easily creating VR experiences using WebVR which work on all platforms. In this session, audience will learn to use various concepts & APIs of A-Frame through demos and live coding few WebVR scenes. With this, you will be able to create interactive and immersive VR websites on the web. This session will also cover following: - How A-Frame is different from ReactVR - Keys to make your VR website to have immersive experience - How can one get involved with the A-Frame community to contribute in its development",
   "Speaker": "Ram Dayal Vaishnav",
   "Bio": "Ram Dayal Vaishnav, Senior Web Developer at Arcesium, is very passionate about Open Source and has been to Mozilla’s projects for more than 5 years now. He is also a [Mozilla Tech Speaker](https://wiki.mozilla.org/TechSpeakers#Mozilla_Tech_Speakers) & [Mozilla Representative](http://reps.mozilla.org/u/ram). Interested in [future technologies](https://www.w3.org/community/webvr/), Ram has been involved with Mozilla’s WebVR framework A-Frame since its birth in late 2015. Apart from code contribution, he has also given talks on A-Frame & future technologies at various international events including [SHA2017 Netherlands](https://program.sha2017.org/events/84.html), [FOSSASIA Singapore](http://2016.fossasia.org/#speakers) & [MozFest London](https://mozillafestival.org/).\\n\\nRam is also a co-founder of [WebVR India](https://blog.mozvr.com/webvr-india-community-conducts-webvr-hack-night/) group, a developer community in India working on VR development & evangelism. DevDiner.com, a website related to emerging technologies, named Ram as one of their [VR inspirations of 2016](https://devdiner.com/virtual-reality/thank-you-to-our-vrar-inspirations-of-2016) for his inspirational work in the fields of VR & IoT.",
   "Notes": "Requirements: 1. A laptop/computer (with net connectivity) for coding. 2. A mobile phone and a VR device for testing the VR experiences built.\\n\\nWe need VR Devices (Cardboards / Daydream View / HTC Vives) to test the VR experiences build by audience. We can make few devices available for all participants, additionally we can ask participants to get their own devices with themself.",
   "Format": "Full"
 },
 {
   "Title": "Constructing REST APIs in Python & Deploying to AWS",
   "Abstract": "In this talk, i am going to explain how to write REST APIs in python with Flask micro-framework. Then we are going to deploy this API to AWS cloud and make it public. We will use Lambda, S3 and API Gateway services of AWS to deploy and manage our REST architecture.",
   "Description": "As python is a backend engineering language, in best practices we write APIs in python and then we can connect logic to any interface like web, mobile, IoT, bots etc. So, writing APIs is the core backend engineering in any software development process.\\n\\nAfter writing the important part comes is to host and scale our REST API architecture in cloud server. There are tons of\\nclouds they do support python hosting like heroku, openshift, pythonanywhere, AWS etc. But the most powerful and scalable\\ncloud to use is AWS(Amazon Web Services).\\n\\nSo, in this talk i am going to explain how we can write APIs in python with Flask framework. After this i will explain how\\nto deploy APIs to AWS services. We are going to use following AWS services to deploy our API.\\n\\n- Lambda\\n- S3\\n- API Gateway\\n\\nTalk Outline\\n\\n- Understaing REST architecture\\n- Flask Overview\\n- Coding starts\\n- First API Endpoint\\n- Running & Testing in local server\\n- Introducing Zappa\\n- AWS Setup\\n- Deploy to AWS\\n- Managing APIs\\n- Q/A",
   "Speaker": "Daxeel Soni",
   "Bio": "Computer Engineering undergrad student with the passion of startup product building using tech skills. I build stuff in the domain of Chatbots, web and IoT.\\n\\nI can be found at various tech and startup events in India. So, I meet new people, read online and build crazy products\\nwith my tech skills.\\n\\nProfile - https://daxeel.github.io",
   "Notes": "Respected Sir/Ma’am,\\n\\nI am 4th engineering student working with startups based in India and USA as a Backend Engineer(Python). I am creating\\ncrazy things in Python since when I was in class 12. I also contribute to open source community.\\n\\nApart from coding, I love to teach Python. I invited to some universities as an expert lecturer to teach students Python\\nlanguage. I am also one of the coaches of Django Girls(UK) Ahmedabad chapter.\\n\\nRecently i am selected for “Hack the North ‘17” MLH Hackathon which is going to be held on 15-17th September at the\\nUniversity of Waterloo, ON, Canada.\\n\\n- PythonExpress Educator\\n- Coach at Django Girls(UK), Ahmedabad Chapter\\n- Co-lead at Facebook Developers Circles, Ahmedabad\\n- GDG Speaker\\n\\nSome of my projects at hackathons\\n\\n- HeyNews ChatBot - https://m.me/heynewsbot - Python, Flask, Facebook API\\n- PyPixoto - https://github.com/daxeel/CelebInfo-API - Python, Flask, BeautifulSoup\\n- CelebInfo API - https://github.com/daxeel/CelebInfo-API - Python, Flask, BeautifulSoup\\n- DeftellAI - https://github.com/daxeel/DeftellAI - Python\\n- Facebook chatbot controlled CNC Machine - https://github.com/daxeel/HackInOut2016 - Python, Flask\\n\\nEverything about me you can find here : https://daxeel.github.io",
   "Format": "Full"
 },
 {
   "Title": "Consumer Driven Contracts for Microservices",
   "Abstract": "CDCs are “Asynchronous Integration Tests”.CDC stands for Consumer Driven Contract. We can now forget about bringing up all the microservices to test the integration between different microservices.This makes integration tests as simple as unit tests. This is a must-have test for all microservices.",
   "Description": "CDC Tests - Consumer Driven Contracts\\nIntegration Tests aim at testing the interaction between different components/microservices. Traditionally, the way it is\\ndone is to bring up all the components/microservices and then test the interactions between them. But the problem with this\\napproach is: - It is slower (You’ve got to prepare and start each service) - At times we end up doing an End-to-End Test to\\njust test the interactions\\n\\nIs there a better/ faster way of doing it? Yes! This is where the CDCs come to rescue. CDCs are “Consumer Driven Contracts”\\nwhere a contract(or pact which is nothing but a JSON file) is maintained between the provider service and the consumer\\nservice.The following are the steps involved in CDC: - The consumer defines what it expects from a specific request to a\\nservice. - The provider and the consumer agree on this contract (pact) - The provider continuously verifies that the\\ncontract is fulfilled\\n\\nWhat does it validates? - The API endpoint is valid - The response format is accepted and contains the same data (from the\\ncommonly agreed state)\\n\\nWhy is it better? - No need for multiple services to be started up and wired together - Consumers are responsible for the\\ncreation and maintenance of their contracts - Providers have better peace-of-mind when making changes - These tests can be\\nadded to CI and any broken contract can be immediately alerted (Since the pact is always kept in tact at all times)\\n\\nWe were able to implement this test for our microsercives and were able to reap the benefits. Its even more beneficial when we work with external teams . This test actually serves as the best means of communication between both teams.",
   "Speaker": "Ramya Authappan",
   "Bio": "Ramya is passionate about building/designing test frameworks.She loves to build robust automations which would enable safe and quick delivery of code to customers! “Simple, but powerful” is her slogan for building frameworks/tools. She has around 10 years of experience and is currently enjoying her role as a Lead SDET in Freshworks. Prior to Freshworks, she has worked in PayPal and Amazon. She is also actively involved in WomenWhoCode Chennai Chapter and helps in organizing the monthly meetup for the same. She resides in Chennai with her 3 year old angel and her husband and parents. On a personal front, she enjoys travelling and hanging out with family and friends. Sheryl Sandberg had been her all-time inspiration!",
   "Notes": "We have implemented this for our Ruby on Rails based microservices and Nodejs microservices and few CDC Tests are written to test interaction between an ROR and Nodejs microservice.We used a ruby gem called “pact” to achieve this. The ruby implementation was a piece of cake, because pact gem itself was originally written in Ruby. But then the Nodejs implementation was a real challenge - we used an npm module called ‘pact’ and ‘pact-node’ for this, which is nothing but a node wrapper over the Ruby implementation. There were few issues/bugs we faced (which was fixed by the author) and also, the lack of documentation and lack of a clean node implementation added to it. Thanks to the authors who were really helpful. (They are building a mocha-based implementation for pact which a cleaner solution in Nodejs .) - We store/fetch the pacts(contracts) in S3. - We have it added as part of our CI for all the microservices (providers and consumers). So the pacts are always kept up-to-date.\\n\\nEver since we implemented these tests, we had been advocating this for all other teams in my organisation (which talks to each other via JSON objects) I find this test to be a really effective one, but then it seems to be less popular - It would be great for other organisations to get to know about it and make fullest use of it.",
   "Format": "Full"
 },
 {
   "Title": "Creating my own emoji programming language",
   "Abstract": "Creating a programming language is sometimes boring and requires a lot of dedication and knowledge about how compiler works. I have been thinking about creating something similar just for fun and emoji’s are fun. So the idea expressing a syntax just by emojis are interesting.",
   "Description": "This talk will be similar to creating something like [emojicode](https://github.com/emojicode/emojicode)\\n\\nBut I will focus more on how to create a brand new programming language. And if anyone is interested then what are some of\\nthe important things one should consider. A lot of points that I will discuss are borrowed from [this article]n(http://www.drdobbs.com/architecture-and-design/so-you-want-to-write-your-own-language/240165488)\\n\\nI will also focus on how parsers and compilers work.\\n\\nIn stead of explaining or showing something which is already being made like Emojicode. I will showcase some basic demonstration of a toy emoji language and possibly some (not so useful) use case of my toy language.",
   "Speaker": "Subhransu Behera",
   "Bio": "- Mobile Platform Lead at Singapore Power\\n- Previously lead the mobile team at PayPal and SAP\\n- Former contributor to [RayWenderlich.com](https://www.raywenderlich.com/)\\n- Organizer of [iOS Conf SG](http://iosconf.sg/)",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "Hacker's guide to Rust Programming",
   "Abstract": "Venture deep into the belly of the state of art programming language Rust’s design and concepts to uncover the secret incantations to create high performance and memory safe applications.",
   "Description": "Rust is a systems programming language that runs blazingly fast, prevents segfaults, and guarantees thread safety. It won the first place for “most loved programming language” in the Stack Overflow Developer Survey in 2016 and 2017.\\n\\nBut what makes Rust so fast & safe? Starting from the basics, this workshop will walk you through the core design &\\nconcepts of Rust Language which include:\\n\\n- Syntax and keywords in Rust\\n- Concept of ownership and borrowing to understand memory safety & management\\n- Polymorphism using Traits\\n- Error handling in Rust\\n- Package management using Cargo tool\\n- Famous Rust tools like clippy, Rustfmt, Rustup etc\\n- Live demos of web development, FFI to understand different applications\\n\\nDiscover this and more tips to build creating highly concurrent and highly safe systems using Rust.\\n\\nSession Content:\\n\\n- Introduction to Rust\\n- Overview of Rust type system\\n- Deep dive into Ownership & borrowing concept\\n- Building user defined data types & creating custom functionalities\\n- Learn about error handling in Rust\\n- Understanding macros\\n- Packaging and shipping Rust applications\\n- Live Demos for web development and FFI examples\\n\\nKey Takeaways\\n\\n- Audience will be able to appreciate the core design behind Rust language which enables it to be super fast and safe\\n- Get a hands on programming experience with Rust Lang\\n- Learn in details about Rust community and tool ecosystem",
   "Speaker": "Vigneshwer Dhinakaran",
   "Bio": "Vigneshwer is an innovative data scientist from Bengaluru who crunches real-time data and builds AI algorithms for complex business problems. He believes that technology needs to have a human-centric design to cater solutions to a diverse audience. He’s an official Mozilla TechSpeaker, and is the author of Rust Cookbook.",
   "Notes": "Speaking Credentials:\\n\\n- Delivered a session on demystifying AI in Mozfest 16 Open Science space\\n- Active Rust community, Rust India community mentor and leading of RainOfRust campaign\\n- Spoke about building AI models in rust at FOSSMEET17 @NITC & HKOSCon 2017\\n- Speaker at Codemotion Berlin, & Devfest Siberia\\n\\nSpeaker Skills:\\n\\n- Trained on developer evangelism skills in Mozilla TechSpeaker program\\n- Author of [Rust Cookbook](https://www.packtpub.com/application-development/rust-cookbook)\\n- Awarded [Rep of the Month](https://blog.mozilla.org/mozillareps/2017/07/28/rep-of-the-month-july-2017/) for being heavily involved in helping build the Rust community in India\\n- Identified as a [Rust Mobilizer superstar](https://blog.mozilla.org/mozillareps/2017/07/10/reps-mobilizer-experiment/) and conducted [Mozilla’s mobilizer experiment pilot](https://discourse.mozilla-community.org/t/results-of-the-mobilizer-experiment-for-rust-india/) for Rust in India\\n- Founder and project lead for DeepRust, a deep learning library in Rust\\n- 3+ experience in implementing state of art ML algos for production IOT pipelines\\n\\nRainOfRust Video Series:\\n\\n- [Introduction to Rust Lang](https://air.mozilla.org/rain-of-rust-2nd-online-meeting/)\\n- [Web development in Rust](https://air.mozilla.org/rain-of-rust-3rd-online-meeting/)\\n- [Rust API guidelines & std lib](https://air.mozilla.org/rain-of-rust-4th-online-meeting/)\\n\\n- Blog posts:\\n\\n- [Hacker’s guide to Rust programming](https://dvigneshwer.github.io/talks/2017-04-07-Rust-AIT)\\n- [Web development in Rust](https://dvigneshwer.github.io/posts/2017/05/Rust-web-dev/)\\n\\nSlides:\\n\\n- [Introduction to Rust](https://dvigneshwer.github.io/files/Deep_drive_into_Rust_programming_language.pdf)\\n- [Building AI units in Rust](https://dvigneshwer.github.io/files/AI_Rust.pdf)",
   "Format": "Full"
 },
 {
   "Title": "Hacker's guide to Web Assembly",
   "Abstract": "Starting from the basics, this talk will walk you through what WebAssembly is, and then why it’s fast.",
   "Description": "WebAssembly is a new low-level binary compile format that will do a better job at being a compiler target than JavaScript. It’s being called “the future of the web platform” and did you know that its promising features in terms of speed, reusability, and safety have brought major browser vendors working together to make it a reality and the MVP is already available in major browsers.\\n\\nWant to know how WebAssembly work? Why is WebAssembly so fast? How to build web apps using C/C++/Rust? In this talk we’ll\\nlook at history, basics, applications and deep dive into the core concepts of WebAssembly with help of live demos and\\ncoding.\\n\\nSession Content\\n\\n- Introduction to WebAssembly\\n- Live Demos\\n- History and Need of WebAssembly\\n- Live Coding\\n- Reasons to use WebAssembly\\n- Applications of WebAssembly\\n- Community Details and support Channels\\n\\nKey Takeaways\\n\\n- The audience will appreciate WebAssembly as a new way to compile multiple languages to web\\n- Understand the various use cases and features of wasm\\n- Learn about the wasm community support and usage of tooling ecosystem",
   "Speaker": "Vigneshwer Dhinakaran",
   "Bio": "Vigneshwer is an innovative data scientist from Bengaluru who crunches real-time data and builds AI algorithms for complex business problems. He believes that technology needs to have a human-centric design to cater solutions to a diverse audience. He’s an official Mozilla TechSpeaker, and is the author of Rust Cookbook.",
   "Notes": "Speaking Credentials:\\n\\n- Delivered a session on demystifying AI in Mozfest 16 Open Science space\\n- Active Rust community, Rust India community mentor and leading of RainOfRust campaign\\n- Spoke about building AI models in rust at FOSSMEET17 @NITC & HKOSCon 2017\\n- Speaker at Codemotion Berlin, & Devfest Siberia\\n\\nSpeaker Skills:\\n\\n- Trained on developer evangelism skills in Mozilla TechSpeaker program\\n- Author of [Rust Cookbook](https://www.packtpub.com/application-development/rust-cookbook)\\n- Awarded [Rep of the Month](https://blog.mozilla.org/mozillareps/2017/07/28/rep-of-the-month-july-2017/) for being heavily involved in helping build the Rust community in India\\n- Identified as a [Rust Mobilizer superstar](https://blog.mozilla.org/mozillareps/2017/07/10/reps-mobilizer-experiment/) and conducted [Mozilla’s mobilizer experiment pilot](https://discourse.mozilla-community.org/t/results-of-the-mobilizer-experiment-for-rust-india/) for Rust in India\\n- Founder and project lead for DeepRust, a deep learning library in Rust\\n- 3+ experience in implementing state of art ML algos for production IOT pipelines\\n\\nRainOfRust Video Series:\\n\\n- [Introduction to Rust Lang](https://air.mozilla.org/rain-of-rust-2nd-online-meeting/)\\n- [Web development in Rust](https://air.mozilla.org/rain-of-rust-3rd-online-meeting/)\\n- [Rust API guidelines & std lib](https://air.mozilla.org/rain-of-rust-4th-online-meeting/)\\n\\n- Blog posts:\\n\\n- [Hacker’s guide to Rust programming](https://dvigneshwer.github.io/talks/2017-04-07-Rust-AIT)\\n- [Web development in Rust](https://dvigneshwer.github.io/posts/2017/05/Rust-web-dev/)\\n\\nSlides:\\n\\n- [Introduction to Rust](https://dvigneshwer.github.io/files/Deep_drive_into_Rust_programming_language.pdf)\\n- [Building AI units in Rust](https://dvigneshwer.github.io/files/AI_Rust.pdf)",
   "Format": "Full"
 },
 {
   "Title": "How about Go Lang... from a Ruby Guy?",
   "Abstract": "So i’ve had 10 years working on PHP. I have mastered Ruby & Ruby on Rails… now on to the next conquest - Go Lang!",
   "Description": "So i’ve had 10 years working on PHP. I have mastered Ruby & Ruby on Rails… now on to the next conquest - Go Lang!",
   "Speaker": "Michael Cheng",
   "Bio": "Michael Cheng is a full stack developer with more than 10 years of experience building dynamic websites. He is a Zend Certified Engineer/Trainer in PHP development. He currently does Ruby & Go Lang. He runs the Singapore PHP User Group, co-founded the iOS Dev Scouts and is the organiser of PHPConf.Asia.\\n\\nHis latest passion project is Engineers.SG, a not-for-profit community initiative to document and archive the tech and\\nstartup scene in Singapore.\\n\\nMichael is currently a Senior Software Engineer with Singapore Power.",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "How and Why I almost wrote an ORM",
   "Abstract": "Sometimes when you can’t find existing solutions, you just go ahead and build your own. As you evolve what you build, it will start to grow and start to do more than what it was meant to. This is one of those times.",
   "Description": "When we started moving to micro services and started using tornado as a framework, there wasn’t a mongo ORM that uses tornado except motorengine. MotorEngine is under-developed and not stable. Decided that I will not validate the field one key at a time, I decided to just write a checker that checks python’s dictionary for errors.\\n\\nTurns out it was a good idea, and I started using it in more services.\\n\\nAfter 2 years, more features was added to it, built around it, and slowly, it start to look more and more like an ORM.\\n\\nThis is not technical, just sharing the journey of writing the checker, and the learnings I got from it.",
   "Speaker": "Eric",
   "Bio": "Backend Lead @ 99.co, enjoy over-engineering and building generic solutions to problems. Write games for fun.",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "How did I help 5000+ testers with few lines of code!!",
   "Abstract": "I’d like to talk about the pain points I faced while automating the web application with dynamic test data and how did I overcome the difficulties with the help of my chrome extension.",
   "Description": "I’m the creator of “Relative xpath helper” chrome extension.\\n\\nI’d like to talk about the pain points I faced while automating the web application with dynamic test data and how did I\\novercome the difficulties with the help of my chrome extension.\\n\\n“Relative xpath helper” chrome extension can provide the relative xpath expression in two clicks. People from 110+\\ncountries are using this chrome extension as of today (23-Aug-2017)\\n\\nLink to the app : https://chrome.google.com/webstore/detail/relative-xpath-helper/eanaofphbanknlngejejepmfomkjaiic",
   "Speaker": "Syam Sasi",
   "Bio": "I’m Syam Sasi, currently working as QA engineer at Carousell, Singapore. Passionate QA, love to learn new things\\n\\nhttps://www.linkedin.com/in/syam-sasi/",
   "Notes": "",
   "Format": "Lightning"
 },
 {
   "Title": "Make More Than Music with Tiny Computers, JavaScript and MIDI",
   "Abstract": "We’re living the halcyon days of tiny computers and JavaScript, but MIDI is a technology that’s been around for much longer. In this talk we’ll explore why it’s implementation and prevalence in musical hardware makes for a uniquely intriguing and accessible platform for creative coding.",
   "Description": "Tiny computers such as the RaspberryPi, Arduino and C.H.I.P. have finally reached a level of performance and affordability that makes hardware experimentation accessible to everyone. At the same time, JavaScript has emerged as the lingua franca of web programming and can be found in many places beyond just the browser.\\n\\nWhat if I told you there was a mature protocol that’s been around since 1983 and was uniquely poised to take advantage of\\nthis development?\\n\\nWell, wonder no more and meet MIDI!\\n\\nSitting at convergence of these two things is MIDI — a niche protocol that’s been around since 1983 and was originally\\ndesigned for musical instruments to communicate with one another. It’s event-oriented approach to messaging feels right at\\nhome in the asynchronous world of JavaScript & Node, and the prevalence of MIDI support in older musical equipment means\\nyou can find unique, hackable and affordable hardware at your local pawnshop or Craig’s List.\\n\\nThis unlikely tech stack — Tiny Computers + JavaScript + MIDI — can lend itself to creative programming beyond music. George’s Talk will explain how to get started, walk through several examples and elaborate on the future of this stack, not only as a platform for experimentation but for education as well.",
   "Speaker": "George Mandis",
   "Bio": "George Mandis has been a freelance, full-stack web developer and consultant to startups, small businesses, professional sports teams and entrepreneurs for over a decade. Recently he spent a year living as a digital nomad, inadvertently cheated while running a marathon in North Korea and ran a coding bootcamp out of Portland, Oregon. He writes frequently on technology, travel and other things at [his website](http://george.mand.is/).",
   "Notes": "I have lots of demos and creative projects I’ve created using this stack. This conference and talk would be a fun opportunity to share them!",
   "Format": "Full"
 },
 {
   "Title": "Of Course We Tust The WIFI",
   "Abstract": "We all love to be connected and we love public WIFI! Of course we know that we should use HTTPS and VPN, we’re not that silly! But what about our friends and family? Should we leave them to fend for themselves? Of course not! So how do we keep them safe while using that awesome free WIFI?",
   "Description": "Of Course We Trust The WIFI\\nWe all love staying connected online and one o the ways that we do that is by using the many publicly available WIFI access\\npoints. The question is how much do trust that our connection is safe and that we are connecting to an access point that\\nreally is who it claims to be?\\n\\nBeing security conscious people, we know that we should always use secure connections whenever possible, be it connecting\\nto websites using HTTPS or by using a VPN connection. But what if we are with friends and family who might not be as\\nsecurity conscious or minded? How are we going to ensure that they are safe using the public WIFI?\\n\\n> We cannot make a system/network 100% secure. We can just make the cost of breaking into it higher.\\n\\nWell, why don’t we build a secure access point for them? This talk will study the theory behind the methods and technology used in creating a secure access point and how one can be built inexpensively.",
   "Speaker": "Muhammad Hazwan Bin Hassan Mokyi",
   "Bio": "Who is this fellow?\\n\\n- Recovering former Public Servant/LEO\\n- Struggling SOC Analyst\\n- Security Enthusiast\\n- Hardware hacking Novice\\n- Lover of all things Wireless\\n- Go’er of Meetups and Conventions\\n- Holder of certs",
   "Notes": "About the talk\\n\\nThis is the next talk in a series relating to WIFI security and follows the talk given at Hackware v2.8 titled: WIDPS - A\\nHomebrew Solution.\\n\\nWhy this talk\\n\\nThis is a modern update on the portable WIFI access point project based on OpenWRT/DD-WRT and OpenVPN. The original\\ntutorial assumes that the connection to the internet will be using an Ethernet connection but many establishments such as\\nhotels and event venues no longer serve internet via physical hard-points. Instead many if not all have switched to serving\\ninternet to their customers via WIFI. As such this talk is to provide an update allowing the secure access point to connect\\nto the locations internet via WIFI instead of Ethernet.\\n\\nSecurity Note\\n\\nIf the organiser allows and a public WIFI is available in the venue, a rogue AP might be deployed as part of the practical example. If deployed, attendees should be informed of the fact that a rogue AP is present within the vicinity. Personal information will not be collected by the rogue AP, only the MAC address of the connected device will be collected and shown on the screen ala the “Screen of Sheep” found at DefCon.",
   "Format": "Full"
 },
 {
   "Title": "Stop Calling (them) Millennials! Bringing Executive Coaching to Tech College Students",
   "Abstract": "Executive Coaching has been embraced by leaders in boardrooms across the globe - Let’s talk about the impact of bringing an Executive Coach into the classroom and how Post Secondary Technology students have embraced this 1-on-1 approach that helps them focus on their academic and personal success.",
   "Description": "Let’s stop labeling the next generation with words like Millennial and instead focus and think of them as people; by coaching to develop their non-cognitive skills (aka soft skills.) How much would your team/company be impacted if you hired graduates with strong interpersonal skills? Could we do a better job preparing students for the soft skills gap of working in the real world? I argue we can and should. The next generation doesn’t want to be taught or told -> Could they be guided and coached towards their professional development? What if your new hire understood how to give and receive behaviour based feedback? What if your new hire was self aware of their conflict resolution style and could quickly and easily navigate thru various conflict resolution models? Then why not bring executive coaches into post secondary schools?\\n\\nMy Key Take Aways would include How executive coaching has been successfully used to develop non-cognitive skills with post\\nsecondary students The specific techniques covered in the 15 minute one-on-one sessions the executive coach has with the\\ncollege students How everyday leaders can leverage these executive coaching techniques to help develop the next tech\\ngeneration\\n\\nHere is a short video pitch of this idea https://youtu.be/dK8MLs0HcbI\\n\\nHere is a link to a short 8 minute TEDxTalk I did on this concept at Furman University in South Carolina earlier this year\\n- https://youtu.be/ZjZHVBGLs00\\n\\nSpeakerhub profile - https://speakerhub.com/speaker/matt-stewart\\n\\nLinkedIn - https://www.linkedin.com/in/beardedleader/",
   "Speaker": "Matthew Stewart",
   "Bio": "Matt Stewart is a no bullshit activator of potential. His No Excuses, Now What approach has been fostered & developed over the past 20+ years from coaching, collaborating and advising Senior Leaders across North America. In 2015 he said F U to Cancer and forged his own path and launched his proprietary no-holds-barred success coaching system. His foundational philosophy is boldly simple: move past the excuse —> laser focus on the next steps and you can accomplish a shit-tonne. The most important thing a leader, boss, manager or ANYONE can do is ask yourself “How Am I Framing This?”. How You Frame anything in life will impact the specific macro & micro-actions you take and will impact the tribes you choose to let into your life.\\n\\nMatt’s approach is not some sit-around-a-campfire-hug-a tree-and-kiss-puppies kind of approach. It is based in the thought\\nprocess that – no one owes you anything! This pragmatic whiskey-on-the-rocks approach has served Matt well during his years\\nin Healthcare, the Vancouver 2010 Winter Olympics, Finance and now as a Success Coach in post-secondary. Before venturing\\ninto the mountains of the Interior of BC – Matt also facilitated leadership training for the Toronto2015 Pan Am Games and\\ntaught in Tokyo Japan.\\n\\nRemember —> Accept No Excuses and only ask Now What.",
   "Notes": "I was an Executive Coach and Leadership Facilitator in the Global Finance and Banking Industry traveling across North America in billion dollar deals but after a diagnosis of incurable Leukemia I decided to give up my 6 figure salary and leave the big city to move to the mountains in the Interior of British Columbia – bringing that Executive Coach mindset to a small private post-secondary school. As our next generation prepares to enter the workforce – my challenge is this —- how are we preparing them with the self-directed mindset in order to be successful in this ever changing and highly competitive world?",
   "Format": "Full"
 },
 {
   "Title": "The Dark side of Internet of things",
   "Abstract": "With the advent of Internet of things, monitoring and controlling electrical appliances over the internet has become a child’s play. But are we really making our lives simpler or diving ourselves in a vast ocean which is getting deeper and deeper?",
   "Description": "In today’s world where the security of our data of a major concern, the number of websites are always tracking what we search for, what we watch, our location and now when things are limited to only data, adding another dimension i.e. physical entities is really a big question.\\n\\nrom this talk audience will take away an understanding of the privacy concerns related to IoT, and how they may be putting\\ntheir personal information at risk by connecting my physical entities to the internet. Is it really safe to connect things\\nto the internet?\\n\\nThere are two ways in which the talk can be presented,\\n\\n1) Without Demos\\n\\nTime Duration: 20 mins\\n\\nTalk Structure:\\n\\nGeneral Discussion on What Is IoT and its future\\n\\nThe pros and cons of connecting things to the internet\\n\\nHow exploiters can breach the security and know our lifestyles\\n\\n  With a smart home rigged with cameras, can provide an intruder with victims' various details including lifestyles and\\nvisible passwords.That might result in identity theft with all the access codes including the biotech passwords.\\n\\nWould suggest the methods for handling the security threats with channeled password inputs and multi-level user\\nverification implementation.\\n\\n2) With Demos\\n\\nTime Duration: 30 mins\\n\\nTalk Structure:\\n\\n  Points discussed above (the ones without demo)\\n\\n  Implementing basic IoT attacks: During the session, we would implement some basic IOT attacks (eg. a quadcopter with\\ndevelopment board mounted to demonstrate sniffing attacks, Hacking the FM frequency of participants).\\n\\n  Live demo & session on increasing security: Participants will learn how to increase the security and bypass few of these\\nattacks.\\n\\n  along With this, we would also demonstrate to how to implement a multilevel security with a combination of UHF-RF ID,\\nBiometrics and Voice recognition.\\n\\n  Taking steps beyond: We would also discuss the mechanism that can be adopted to ensure internet privacy. We would teach algorithms to generate real-time authentication keys using NFC and UHF-RF ID tags. We would also demonstrate the live development of scripts that can be used to implement dynamic key updates to ensure authorized access",
   "Speaker": "Dipesh Monga",
   "Bio": "Contributing to Mozilla as a Techspeaker and working as a Research Associate for Internet of things based System on chips, Dipesh has published a few papers on Web of things. He loves to speak at IoT and Web Literacy based events and have conducted more than 50 events for the same.",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "The Day I met Steven",
   "Abstract": "Come hear a story about a dev named Steve — the first developer to shatter my world view that all devs actually care. Maintaining passion in this industry can be tough and burnout is a real threat to devs. Learn to identify “Steve-like” characteristics in yourself. Together we can overcome the salt!",
   "Description": "The day I met Steven\\nLevel: All • Type: Soft\\n\\nIntro Hi, my name is Alyssa! I am a front-end dev that loves life, learning, helping people, and solving problems with\\ncode. I’m here to tell you all about the day I met Steve. Steve shattered this idea I had in my head. The idea that all\\ndevs care. Steve represents old curmudgeonly developers who have lost all sense of passion and purpose. Come learn how to\\nidentify “Steve-like” characteristics in yourself and some tips on how to avoid eventually turning into a jaded and grumpy\\ndeveloper. Maintaining passion in this industry can be tough, but together we can overcome the salt!   Main Points 1.\\n[intro- the story of meeting steve] 2. Identifying Steve-like characteristics in yourself 3. How do you keep yourself from\\nbecoming a Steve, how do you maintain passion in this industry?\\n\\nExample of slide style\\n\\nhttp://cl.ly/kRLG http://cl.ly/kQhZ\\n\\nPreviously Performed\\n\\nhttps://www.youtube.com/watch?v=tfw3bhaDbsA&index=19&t=2s&list=PLOETEcp3DkCoS_2cW205cfRGl-Xp5jw4K",
   "Speaker": "Alyssa Nicoll",
   "Bio": "I am an energetic, über passionate GDE and Web Dev. I have some Front-End and Angular courses on Egghead.io and Code School. I love to learn new things and share them with others. I Scuba Dive and have a toothless dog named ‘Gummy’. My DM is always open, come talk sometime.",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "UI, beyond pixels",
   "Abstract": "Most of the time when people speak of ui they only think of screens. However there are other methods that are ignored such as tangible user interface or voice user interface.\\n\\nit can serve an underserved population and open up new markets. At the same time how it can be done right.",
   "Description": "Voice based user interface is often neglected. However it can be the tool that differentiates business.\\n\\nhttps://docs.google.com/presentation/d/1KwuxMD3yxCt6hWjo_XXfI2D-Sz0i5B4kc28WFZgC5dQ",
   "Speaker": "Yi Chiao Cheng (Yitch)",
   "Bio": "CTO @Hishab, fintech in emerging markets",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "Un-sucking Our Service Components",
   "Abstract": "Micro services are amazing. They are easy to develop, arguably easier to scale, and allow multiple teams in various countries to work in parallel. They make life easier – until they don’t. Here, I’ll explain my experience and the things I learned while un-sucking the service components at work.",
   "Description": "Micro services are amazing. They are easy to develop, arguably easier to scale, and allow multiple teams in various countries to work in parallel. They make life easier – until they don’t. The components that these services are comprised of can become large, with multiple responsibilities and dependencies on other services or components. This was the case with the services at work. The code base grew, the dependencies grew, and level maintainability started to slowly decrease.\\n\\nIn this talk, I’ll discuss my experience and the things that I learned while breaking down the components at work.",
   "Speaker": "Zac Brown",
   "Bio": "Zac Brown is a self taught software engineer currently working for a Berlin based fintech startup called SumUp. Zac has previously spoken at various public events including the Open Tech Summit, azPHP, and more. He is a strong open source advocate and enjoys every opportunity to share and obtain knowledge relating to new technologies.",
   "Notes": "",
   "Format": "Full"
 },
 {
   "Title": "Using your DevTools for Gain and Glory",
   "Abstract": "No, Firefox DevTools are not Firebug. The web came a long way since Firebug, and so have the DevTools baked into Firefox. So let’s go exploring! This is basically 30 minutes of pure debugging on stage, no slides.",
   "Description": "No, Firefox DevTools are not Firebug. The web came a long way since Firebug, and so have the DevTools baked into Firefox. So let’s go exploring! As the complexity of the web apps you build keeps moving, so do the Firefox DevTools. In this session, Alex will give you the latest tips and tricks on Firefox DevTools. We’ll explore new and less commonly known features in performance profiling, JavaScript debugging and animation inspection. The session will give you a productivity advantage when developing and debugging your web applications.",
   "Speaker": "Alex Lakatos",
   "Bio": "Alex Lakatos is a newly minted JavaScript Developer Advocate for Nexmo. In his spare time he volunteers at Mozilla as a Tech Speaker and a Reps Council member. JavaScript developer building on the open web, he has been pushing its boundaries every day. You can check out his github profile or get in touch on twitter. When he’s not programming in London, he likes to travel the world, so it’s likely you’ll bump into him in an airport lounge.",
   "Notes": "This session focuses on getting productivity tips when debugging your website. Most features presented are on par with Chrome, so the session is translatable, no matter the browser of your choice. Oh, and it’s all live on stage, no gifs, no videos, no slides. I think I’m the best person to speak about this because I’ve been involved with the Firefox DevTools ever since they started, they actually being just one, the Console, at the time. I’ve been QA Owner for DevTools at a certain point, and still am a daily user.",
   "Format": "Full"
 },
 {
   "Title": "When VR meets Internet of things: Life beyond second life",
   "Abstract": "imagine the possibilities that can exist if we were to we combine the worlds of Virtual Reality and Internet of Things This session will enable people with minimal knowledge of VR and basic IoT boards(such as Arduino, Raspberry Pi) to experience the best of the IoT & VR worlds.",
   "Description": "“It gets even more interesting when virtual and augmented reality meets the Internet of Things.” — Phil Repp\\n\\nIoT is taking over the technology industry with a huge bang! Our focus is to make the IoT smarter and more suitable for\\nhuman interaction. Virtual Reality is the next billion dollar industry and it is the future of the Entertainment, Gaming\\nand Education Industry. Now, imagine the possibilities that can exist if we were to we combine the worlds of Virtual\\nReality and Internet of Things This session will enable people with minimal knowledge of VR and basic IoT boards(such as\\nArduino, Raspberry Pi) to experience the best of the IoT & VR worlds.\\n\\nFurthermore, attendees will experience a remote tele-robotic presence as they transport and assume the identity of a\\nweb-connected robot, tasked with monitoring and maintaining atmospheric conditions.\\n\\nAlong with the view of the place, the robot will be monitoring the nearby surroundings such as temperature, humidity and\\nlight intensity which will be then displayed along with the scenario displayed by VR device. Thus by this audience will\\nlearn how to Combine IoT with VR and hence make their own smart telepresence system like Jarvis.\\n\\nBy the end of the session, the audience will gain an increased understanding of the VR and IoT landscape, as well as how these technologies can be combined to give them an experience in life that was previously never-before-possible. A short Q&A session will be held after the [talk/workshop].",
   "Speaker": "Puja Purswani",
   "Bio": "Being an Electronics Engineer and a Tech Speaker at Mozilla, Pooja loves tinkering with various emerging technologies mainly VR, IoT-based platforms, with a motto of making the web a better and connected place for everyone, and spreading the love of web literacy. She has been conducting workshops at across India spreading the love of tech.",
   "Notes": "Session details\\n\\n1.Without demo\\n\\nTime Duration: 20 mins\\n\\na. The introduction of IoT and VR b. How IoT and VR are the next billion dollar industry c. The combination of IoT and VR\\ncan do wonders d. The experience of a life beyond imagination when both IoT and VR are combined e. What are Telepresence\\nrobots - VR with IoT\\n\\nWith Demo\\nDuration: 25 mins\\n\\na. Points discussed above (the one without demo) b. Building an IoT-enabled robot c. Experiencing VR d. Combining VR with the telepresence bot e. Experiencing the remote telerobotic presence as they transport and assume the identity of a web-connected robot",
   "Format": "Full"
 }
]